Revit 2026 API

# FabricRoundingManagerTotalLengthRounding Property

---

The rounding for Cut Overall Length and Cut Overall Width parameters.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TotalLengthRounding { get; set; }
```
```vb
Public Property TotalLengthRounding As Double
	Get
	Set
```
```cpp
public:
property double TotalLengthRounding {
	double get ();
	void set (double value);
}
```
```fsharp
member TotalLengthRounding : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for value is not a number |
| ArgumentOutOfRangeException | When setting this property: The rounding value is not a positive value. |
| InvalidOperationException | When setting this property: IsActiveOnElement property is false. |

IsActiveOnElement property has to be true. TotalLengthRounding is meaningless if IsActiveOnElement is false.

#### Reference

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace